import { IFeature, IPricing, IQuestionFAQ } from "@/data/types";
import { BrainCog, Edit, Palette, QrCode } from "lucide-react";

export const PRICING_DATA: IPricing[] = [
     {
          id: 1,
          name: "Անվճար",
          description: "Ստեղծել ռեզյումեներ անվճար։ Կրեդիտ քարտ չի պահանջվում: Հարմար է սկսնակների համար, ովքեր ցանկանում են արագ ու պարզ ռեզյումե պատրաստել։",
          price: 0,
          highlighted: false,
          perks: [
               {id: 1,name: "3 ռեզյումե", included: true},
               {id: 2,name: "Հիմնական շաբլոններ", included: true},
               {id: 3,name: "PDF ներբեռնում", included: true},
               {id: 4,name: "Ամբողջական դիզայնի փոփոխություն", included: false},
               {id: 5,name: "AI առաջարկներ", included: false},
               {id: 6,name: "Ուղեկցող նամակների ստեղծում", included: false}
          ]
     },
     {
          id: 2,
          name: "Pro",
          description: "Ստեղծեք ավելի պրոֆեսիոնալ ռեզյումեներ և ուղեկցող նամակներ, մուտք ստացեք բոլոր շաբլոններին, առաջադեմ ձևավորման հնարավորություններին և AI-օգնությանը։",
          highlighted: true,
          price: 14.99,
          perks: [
               {id: 1, name: "Անսահմանափակ ռեզյումեներ", included: true},
               {id: 2, name: "Բոլոր շաբլոնների հնարավորություն", included: true},
               {id: 3, name: "Անսահմանափակ ներբեռնումներ (PDF, Word)", included: true},
               {id: 4, name: "Ամբողջական դիզայնի փոփոխություն", included: true},
               {id: 5, name: "AI առաջարկներ", included: true},
               {id: 6, name: "Ուղեկցող նամակների ստեղծում", included: true}
          ]
     },
]
export const FEATURES: IFeature[] = [
     {
          id: 1,
          name: "AI առաջարկներ",
          description: "Ստացեք օպտիմալացված հմտություններ և նախադասություններ ռեզյումեում։",
          Icon: BrainCog
     },
     {
          id: 2,
          name: "Հեշտ խմբագրում",
          description: "Ավելացրեք և խմբագրեք Ձեր ռեզյումեն առանց դժվարության։",
          Icon: Edit
     },
     {
          id: 3,
          name: "QR Կոդով Ռեզյումե",
          description: "Ստեղծեք QR կոդ, որը հեշտությամբ կարելի է սկանավորել։",
          Icon: QrCode
     },
     {
          id: 4,
          name: "Անհատական Դիզայն",
          description: "Փոխեք տառատեսակները, գույները և դասավորությունը՝ Ձեր նախընտրությամբ։",
          Icon: Palette
     }
]
export const FAQ_DATA: IQuestionFAQ[] = [
     {id: 1, question: "Ինչպե՞ս կարող եմ ստեղծել ռեզյումե այս պլատֆորմում։", answer: "Պարզապես գրանցվեք, լրացրեք Ձեր տվյալները և ներբեռնեք պատրաստ ռեզյումեն։"},
     {id: 2, question: "Կարո՞ղ եմ անվճար օգտագործել այս ծառայությունը։", answer: "Այո, դուք կարող եք ստեղծել մինչև 3 ռեզյումե անվճար և ներբեռնել դրանք PDF ֆորմատով։"},
     {id: 3, question: "Ինչպե՞ս կարող եմ անցնել Pro պլանի։", answer: "Pro պլանին անցնելու համար ընտրեք 'Գնել առաջարկը' կոճակը և վճարեք։"},
     {id: 4, question: "Կարո՞ղ եմ փոփոխել իմ ռեզյումեն հետո։", answer: "Այո, դուք ցանկացած պահի կարող եք մուտք գործել և խմբագրել Ձեր ռեզյումեն։"},
     {id: 5, question: "Ինչ ֆորմատներով կարելի է ներբեռնել ռեզյումեն։", answer: "Ռեզյումեն կարող եք ներբեռնել PDF և Word ֆորմատներով (Pro պլանում հասանելի է նաև Word ներբեռնումը)։"},
     {id: 6, question: "Կա՞ն շաբլոններ, որոնցից կարող եմ ընտրել։", answer: "Այո, մենք տրամադրում ենք տարբեր դիզայնի ռեզյումե շաբլոններ, որոնք կարող եք ընտրել և անհատականացնել։"},
     {id: 7, question: "Կարո՞ղ եմ իմ ռեզյումեն օգտագործել աշխատանքի հայտերի համար։", answer: "Այո, մեր ռեզյումե ձևանմուշները համապատասխանում են միջազգային ստանդարտներին և կարող են օգտագործվել աշխատանքային դիմումների համար։"},
     {id: 8, question: "Ինչպե՞ս կարող եմ կապ հաստատել աջակցման թիմի հետ։", answer: "Դուք կարող եք գրել մեզ 'Հետադարձ կապ' էջում կամ ուղարկել նամակ մեր աջակցության էլ. հասցեին։"}
];